# -*- coding: utf-8 -*-
print ('Домашнє завдання №4')
print ('Третій рівень ("Містер Буль. Джордж Буль!")')
print ('Умова завдання:')
print ('''Задача fizz-buzz:
Ви маєте три числа, вони вводяться з консолі.
Перше число називається fizz,
друге називається buzz.
До третього необхідно дорахувати від одиниці.
Дивлячись на поточне число,
якщо воно кратне fizz – треба виводити F замість числа.
Якщо число кратне buzz – треба виводити B замість числа.
Якщо число кратне і fizz, і buzz, треба виводити FB.
Якщо воно не кратне нічому, виводимо число.
І так - поки не буде досягнуто третього введеного числа.''')
print ('#'*60)
print ('''Додаткова умова:
Написати fizzbuzz для 20 комплектів по три числа,
які записані в файл. Читайте із файлу перший рядок з трьома
числами, беріть із нього числа, рахуйте для них fizzbuzz,
виводите, продовжуйте з наступним рядком і так до кінця файла.
Переробити другу задачу так, щоб результат писався в інший файл.''')
print ('#'*60)
print ('Данні зчитуються з файлу:  input_HW_4_3.txt')
print ('Результат роботи програми записується до файлу:  output_HW_4_3.txt')

with open('input_HW_4_3.txt', 'r') as f:
    with open('output_HW_4_3.txt', 'w') as out:
        for line in f:
            fizz, buzz, number = map(int, line.split())
            out.write('fizz='+ str(fizz)+'\t'+'buzz='+ str(buzz)+'\t'+'number='+ str(number)+'\n')
            for i in range(1, number+1):
                if i % fizz == 0 and i % buzz == 0:
                    out.write('FB ')
                elif i % fizz == 0:
                    out.write('F ')
                elif i % buzz == 0:
                    out.write('B ')
                else:
                    out.write(str(i)+' ')
                if i==number:
                    out.write('\n'*2)