# -*- coding: utf-8 -*-
print ('Домашнє завдання №4')
print ('Умова завдання №4 (практика):')
print ('Банкомат видає суму максимально можливими купюрами.')
print ('#'*50)
n = int (input('Введіть суму, яку повинен видати банкомат: '))
while n<=0 or not n%10==0 :
    print ('''    ПОМИЛКА!!!
Увага!!! Суму, яку може видавати банкомат повинна бути кратна 10.
''')
    n = int (input('Введіть суму, яку повинен видати банкомат: '))

l=[1000, 500, 200, 100, 50, 20, 10]
for i in l:
    k=n//i
    if not k==0:
        print (k, 'x', i, 'грн.')
    n=n-i*k

