# -*- coding: utf-8 -*-
print ('Домашнє завдання №4')
print ('Умова завдання №4 (практика):')
print ('Банкомат видає суму дрібними, але не більше 10 штук кожної дрібної купюри.')
print ('#'*50)
n = int (input('Введіть суму, яку повинен видати банкомат: '))
while n<=0 or not n%10==0 or n>18800:
    print ('''    ПОМИЛКА!!!
Увага!!! Суму, яку може видавати банкомат повинна бути кратна 10.
''')
    n = int (input('Введіть суму, яку повинен видати банкомат: '))
if n<=90:
    print (n//10, 'x', 10, 'грн.') #k10
elif n==100:
    print (10, 'x', 10, 'грн.') #k10
elif n>100 and n<=300:
    if n%20==0:
        print (10, 'x', 10, 'грн.') #k10, k20
        print ((n-10*10)//20, 'x', 20, 'грн.') #k10, k20
    else:
        print (9, 'x', 10, 'грн.') #k10, k20
        print ((n-10*9)//20, 'x', 20, 'грн.') #k10, k20
elif n > 300 and n <= 800:
    if n%50==10:
        print (10, 'x', 10, 'грн.') 
        print (8, 'x', 20, 'грн.') 
        print ((n-10*10-8*20)//50, 'x', 50, 'грн.') #k10, k20, k50        
    elif n%50==20:
        print (9, 'x', 10, 'грн.') 
        print (9, 'x', 20, 'грн.') 
        print ((n-9*10-9*20)//50, 'x', 50, 'грн.') #k10, k20, k50
    elif n%50==30:
        print (10, 'x', 10, 'грн.') 
        print (9, 'x', 20, 'грн.') 
        print ((n-10*10-9*20)//50, 'x', 50, 'грн.') #k10, k20, k50
    elif n%50==40:
        print (9, 'x', 10, 'грн.') 
        print (10, 'x', 20, 'грн.') 
        print ((n-9*10-10*20)//50, 'x', 50, 'грн.') #k10, k20, k50
    else:
        print (10, 'x', 10, 'грн.') 
        print (10, 'x', 20, 'грн.') 
        print ((n-10*10-10*20)//50, 'x', 50, 'грн.') #k10, k20, k50
elif n > 800 and n <= 1800:
    if n%50==10:
        print (10, 'x', 10, 'грн.') 
        print (8, 'x', 20, 'грн.') 
        print ((n-10*10-8*20)//50, 'x', 50, 'грн.') #k10, k20, k50        
    elif n%50==20:
        print (9, 'x', 10, 'грн.') 
        print (9, 'x', 20, 'грн.') 
        print ((n-9*10-9*20)//50, 'x', 50, 'грн.') #k10, k20, k50
    elif n%50==30:
        print (10, 'x', 10, 'грн.') 
        print (9, 'x', 20, 'грн.') 
        print ((n-10*10-9*20)//50, 'x', 50, 'грн.') #k10, k20, k50
    elif n%50==40:
        print (9, 'x', 10, 'грн.') 
        print (10, 'x', 20, 'грн.') 
        print ((n-9*10-10*20)//50, 'x', 50, 'грн.') #k10, k20, k50
    else:
        print (10, 'x', 10, 'грн.') 
        print (10, 'x', 20, 'грн.') 
        print ((n-10*10-10*20)//50, 'x', 50, 'грн.') #k10, k20, k50


# l=[10, 20, 50, 100, 200, 500, 1000]
# for i in l:
#     k=n//i
#     if not k==0:
#         print (k, 'x', i, 'грн.')
#     n=n-i*k

