# -*- coding: utf-8 -*-
print ('Домашнє завдання №3')
print ('Третій рівень ("Містер Буль. Джордж Буль!")')
print ('Умова завдання:')
print ('''Задача fizz-buzz:
Ви маєте три числа, вони вводяться з консолі.
Перше число називається fizz,
друге називається buzz.
До третього необхідно дорахувати від одиниці.
Дивлячись на поточне число,
якщо воно кратне fizz – треба виводити F замість числа.
Якщо число кратне buzz – треба виводити B замість числа.
Якщо число кратне і fizz, і buzz, треба виводити FB.
Якщо воно не кратне нічому, виводимо число.
І так - поки не буде досягнуто третього введеного числа.''')
print ('#'*60)
print ('Введите три цілих числа:')
fizz, buzz, number = map(int, input().split())
for i in range (1, number+1):
    if i%fizz==0 and i%buzz==0:
            print ('FB', end=' ')
    elif i%fizz==0:
            print ('F', end=' ')
    elif i%buzz==0:
            print ('B', end=' ')
    else:
        print (i, end=' ')
    